{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 64, 64, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "filters": 32, "name": "conv2d_30", "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "padding": "valid", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_45"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_29", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_31", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_46"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_30", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_32", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_47"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_31", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_33", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_48"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_32", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_23", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_49"}}, {"class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_24", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_50"}}, {"class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_25", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_51"}}, {"class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_26", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_52"}}, {"class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_27", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_53"}}, {"class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_28", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_54"}}, {"class_name": "Dense", "config": {"units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_29", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_55"}}, {"class_name": "Dense", "config": {"units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_30", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}]}